РП/src/Catalogs/ГруппыФинансовогоУчетаРасчетов/ГруппыФинансовогоУчетаРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыФинансовогоУчетаРасчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПорядокОплаты</name>
    <type>
      <types>EnumRef.ПорядокОплатыПоСоглашениям</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКлиентами</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПолученных</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоВознаграждению</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиками</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовВыданных</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКлиентамиТара</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикамиТара</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Enums/ПорядокОплатыПоСоглашениям/ПорядокОплатыПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокОплатыПоСоглашениям</name>
  <enumValues>
    <name>РасчетыВГривнахОплатаВГривнах</name>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВГривнах</name>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВВалюте</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ГруппыФинансовогоУчетаРасчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет группу финансового учета по умолчанию.
//
// Возвращает группу финансового учета, если найден один элемент справочника.
// Возвращает ПустуюСсылку в противном случае
//
// Параметры:
//	ПорядокОплаты - ПеречислениеСсылка.ПорядокОплатыПоСоглашениям - Порядок оплаты,
//	для которого определяется группа финансового учета
//
// Возвращаемое значение:
//	СправочникСсылка.ГруппыФинансовогоУчетаРасчетов
//
Функция ПолучитьГруппуФинансовогоУчетаПоУмолчанию(ПорядокОплаты) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДанныеСправочника.Ссылка КАК ГруппаФинансовогоУчета
	|ИЗ
	|	Справочник.ГруппыФинансовогоУчетаРасчетов КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И Не ДанныеСправочника.ЭтоГруппа
	|	И ДанныеСправочника.ПорядокОплаты = &ПорядокОплаты;
	|");
	Запрос.УстановитьПараметр("ПорядокОплаты", ПорядокОплаты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		ГруппаФинансовогоУчета = Выборка.ГруппаФинансовогоУчета;
	Иначе
		ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ГруппаФинансовогоУчета;

КонецФункции

// Функция определяет реквизиты выбранной группы финансового учета.
//
// Параметры:
//  ГруппаФинансовогоУчета - СправочникСсылка.ГруппыФинансовогоУчетаРасчетов - Ссылка на группу финансового учета
//
// Возвращое значение:
//	Структура - реквизиты группы финансового учета
//
Функция ПолучитьРеквизитыГруппыФинансовогоУчета(ГруппаФинансовогоУчета) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДанныеСправочника.ПорядокОплаты КАК ПорядокОплаты
	|ИЗ
	|	Справочник.ГруппыФинансовогоУчетаРасчетов КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Ссылка = &ГруппаФинансовогоУчета
	|");
	
	Запрос.УстановитьПараметр("ГруппаФинансовогоУчета", ГруппаФинансовогоУчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПорядокОплаты = Выборка.ПорядокОплаты;
	Иначе
		ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ПорядокОплаты", ПорядокОплаты);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

//++ НЕ УТ 
// Выполняет первоначальное заполнение справочника
//
Процедура СоздатьГруппыФинансовогоУчетаПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчета");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ЯзыкИБ = Локализация.КодЯзыкаИнформационнойБазы();
		
		ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.СоздатьЭлемент();
		ГруппаФинансовогоУчета.Наименование = НСтр("ru='Расчеты в национальной валюте';uk='Розрахунки в національній валюті'",ЯзыкИБ);
		ГруппаФинансовогоУчета.Описание = НСтр("ru='Заполнение по умолчанию';uk='Заповнення по умовчанню'",ЯзыкИБ);
		ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВГривнахОплатаВГривнах;
		
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
		ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных =  ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
		ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных = ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте;
		
		ГруппаФинансовогоУчета.СчетУчетаРасчетовПоВознаграждению = ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВНациональнойВалюте;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентамиТара = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщикамиТара = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
		
		ГруппаФинансовогоУчета.Записать();
		
		ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.СоздатьЭлемент();
		ГруппаФинансовогоУчета.Наименование = НСтр("ru='Расчеты в иностранной валюте';uk='Розрахунки в іноземній валюті'",ЯзыкИБ);
		ГруппаФинансовогоУчета.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте;
		ГруппаФинансовогоУчета.Описание = НСтр("ru='Заполнение по умолчанию';uk='Заповнення по умовчанню'",ЯзыкИБ);
		
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентами = ПланыСчетов.Хозрасчетный.РасчетыСИностраннымиПокупателями;
		ГруппаФинансовогоУчета.СчетУчетаАвансовПолученных = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВИностраннойВалюте;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщиками = ПланыСчетов.Хозрасчетный.РасчетыСИностраннымиПоставщиками;
		ГруппаФинансовогоУчета.СчетУчетаАвансовВыданных = ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВИностраннойВалюте;
		
		ГруппаФинансовогоУчета.СчетУчетаРасчетовПоВознаграждению = ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторамиВИностраннойВалюте;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСКлиентамиТара 	= ПланыСчетов.Хозрасчетный.РасчетыСИностраннымиПокупателями;
		ГруппаФинансовогоУчета.СчетУчетаРасчетовСПоставщикамиТара = ПланыСчетов.Хозрасчетный.РасчетыСИностраннымиПоставщиками;
		
		ГруппаФинансовогоУчета.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
//-- НЕ УТ 

#КонецОбласти

#КонецЕсли
